package itea.lsn4;

public class DZ_task6_StringSubstring {

    //Реализовать аналог String.substring()

    public static void main(String[] args) {
        String s = "Самое короткое слово";
        //System.out.println(s.indexOf("рот", 8));
    }
}